[
  {
    "id": 1,
    "title": "Web Developer",
    "time": "Now",
    "location": "Addis Ababa",
    "pertemp": "Permanent",
    "salary": "45,000",
    "description": "We are looking for a skilled Web Developer to join Tech Innovations. The ideal candidate will have experience in building and maintaining websites using HTML, CSS, JavaScript, and React. You will be responsible for developing user-friendly web applications and collaborating with our design and development teams to enhance the functionality and aesthetics of our platforms.",
    "company": "Tech Innovations",
    "applicationDeadline": "2024-09-30",
    "jobType": "Full-Time",
    "requiredDegree": "Bachelor's degree in Computer Science or a related field",
    "experience": "2+ years in web development",
    "qualification": "Proficiency in HTML, CSS, JavaScript, and React",
    "responsibilities": "Develop, maintain, and optimize web applications. Collaborate with cross-functional teams including designers and developers to create seamless user experiences.",
    "additional": "Experience with backend technologies such as Node.js or Python is a plus."
  },
  {
    "id": 2,
    "title": "DevOps Engineer",
    "time": "Now",
    "location": "Adama",
    "pertemp": "Permanent",
    "salary": "90,000",
    "description": "Cloud Solutions is seeking a DevOps Engineer to manage and optimize our CI/CD pipelines, ensuring system reliability and scalability. The role involves automating workflows, maintaining cloud environments, and collaborating with software developers to streamline deployment processes.",
    "company": "Cloud Solutions",
    "applicationDeadline": "2024-10-15",
    "jobType": "Contract",
    "requiredDegree": "Bachelor's degree in Information Technology or a related field",
    "experience": "3+ years in DevOps or a related field",
    "qualification": "Strong knowledge of cloud platforms, CI/CD pipelines, and containerization technologies such as Docker and Kubernetes",
    "responsibilities": "Automate and streamline operations, manage cloud infrastructure, and ensure the reliability of deployment pipelines.",
    "additional": "AWS or Azure certification is preferred."
  },
  {
    "id": 3,
    "title": "Backend Developer",
    "time": "Now",
    "location": "Addis Ababa",
    "pertemp": "Permanent",
    "salary": "304,582",
    "description": "Data Systems is looking for an experienced Backend Developer to design, develop, and optimize server-side systems. The ideal candidate will be proficient in backend programming languages such as Node.js, Python, or Java, and have experience with database management and performance optimization.",
    "company": "Data Systems",
    "applicationDeadline": "2024-11-01",
    "jobType": "Full-Time",
    "requiredDegree": "Bachelor's degree in Software Engineering or a related field",
    "experience": "5+ years in backend development",
    "qualification": "Expertise in Node.js, Python, or Java. Experience with databases and API integration.",
    "responsibilities": "Develop backend services, manage databases, and optimize performance for large-scale applications.",
    "additional": "Experience with microservices architecture is a plus."
  },
  {
    "id": 4,
    "title": "Frontend Developer",
    "time": "Now",
    "location": "Adama",
    "pertemp": "Permanent",
    "salary": "90,324",
    "description": "Design Studio is seeking a talented Frontend Developer with a passion for creating visually appealing and responsive websites. The successful candidate will have strong experience in JavaScript, CSS, and modern frameworks like Vue.js or Angular, and will collaborate closely with our design team to deliver high-quality web solutions.",
    "company": "Design Studio",
    "applicationDeadline": "2024-10-10",
    "jobType": "Full-Time",
    "requiredDegree": "Bachelor's degree in Web Design or a related field",
    "experience": "3+ years in frontend development",
    "qualification": "Strong skills in JavaScript, CSS, and experience with modern frameworks like Vue.js or Angular",
    "responsibilities": "Develop responsive web interfaces, collaborate with designers to implement UI/UX designs.",
    "additional": "Knowledge of SEO best practices is a plus."
  },
  {
    "id": 5,
    "title": "Flutter Developer",
    "time": "Now",
    "location": "Adama",
    "pertemp": "Permanent",
    "salary": "125,000",
    "description": "App Innovations is hiring a Flutter Developer to build and maintain mobile applications for both Android and iOS platforms. The ideal candidate will be proficient in Dart and the Flutter framework and will collaborate with cross-functional teams to deliver high-performance mobile applications.",
    "company": "App Innovations",
    "applicationDeadline": "2024-10-20",
    "jobType": "Full-Time",
    "requiredDegree": "Bachelor's degree in Software Engineering or a related field",
    "experience": "2+ years in Flutter development",
    "qualification": "Proficiency in Dart and the Flutter framework",
    "responsibilities": "Develop and maintain mobile applications using Flutter, collaborate with designers and backend developers.",
    "additional": "Experience with Firebase is a plus."
  },
  {
    "id": 6,
    "title": "UI/UX Designer",
    "time": "Now",
    "location": "Addis Ababa",
    "pertemp": "Permanent",
    "salary": "45,000",
    "description": "Creative Solutions is looking for a UI/UX Designer to create engaging and user-friendly interfaces. The successful candidate will have a strong portfolio demonstrating design skills and experience in using design tools like Figma or Adobe XD. The role involves conducting user research, creating wireframes, and testing designs to improve user experiences.",
    "company": "Creative Solutions",
    "applicationDeadline": "2024-11-15",
    "jobType": "Part-Time",
    "requiredDegree": "Bachelor's degree in Graphic Design or a related field",
    "experience": "3+ years in UI/UX design",
    "qualification": "Proficiency in design tools such as Figma or Adobe XD",
    "responsibilities": "Design user interfaces, create prototypes, and conduct user research to improve design processes.",
    "additional": "Knowledge of HTML/CSS is a plus."
  },
  {
    "id": 7,
    "title": "Linux Administrator",
    "time": "Now",
    "location": "Addis Ababa",
    "pertemp": "Permanent",
    "salary": "45,000",
    "description": "TechOps is looking for a Linux Administrator to manage and maintain Linux servers. The role involves server setup, maintenance, and troubleshooting. The ideal candidate should have experience with Linux administration and be able to ensure system security and performance.",
    "company": "TechOps",
    "applicationDeadline": "2024-09-25",
    "jobType": "Full-Time",
    "requiredDegree": "Bachelor's degree in IT or a related field",
    "experience": "2+ years in Linux administration",
    "qualification": "Experience with Linux server setup and maintenance",
    "responsibilities": "Manage and maintain Linux servers, perform system updates, and troubleshoot issues.",
    "additional": "Certification in Linux is preferred."
  },
  {
    "id": 8,
    "title": "UI/UX Designer",
    "time": "Now",
    "location": "Addis Ababa",
    "pertemp": "Permanent",
    "salary": "45,000",
    "description": "Design Hub is hiring a UI/UX Designer to improve user experiences through effective design. The role involves conducting research, designing wireframes, and creating prototypes to ensure user-centric interfaces.",
    "company": "Design Hub",
    "applicationDeadline": "2024-11-05",
    "jobType": "Contract",
    "requiredDegree": "Bachelor's degree in Visual Communication or a related field",
    "experience": "3+ years in UI/UX design",
    "qualification": "Proficiency in design software and user research methodologies",
    "responsibilities": "Create wireframes and prototypes, improve user interfaces, and conduct usability testing.",
    "additional": "Experience in mobile app design is a plus."
  },
  {
    "id": 9,
    "title": "SalesForce Developer",
    "time": "Now",
    "location": "Addis Ababa",
    "pertemp": "Permanent",
    "salary": "45,000",
    "description": "SalesTech is looking for a Salesforce Developer to maintain and develop applications within the Salesforce platform. The candidate should have experience in Salesforce CRM, Apex, and Visualforce, and be able to collaborate with stakeholders to implement business solutions.",
    "company": "SalesTech",
    "applicationDeadline": "2024-10-30",
    "jobType": "Full-Time",
    "requiredDegree": "Bachelor's degree in Business or IT",
    "experience": "2+ years in Salesforce development",
    "qualification": "Experience with Salesforce CRM, Apex, and Visualforce",
    "responsibilities": "Develop and maintain Salesforce applications, collaborate with business stakeholders.",
    "additional": "Salesforce certification is a plus."
  },
  {
    "id": 10,
    "title": "Data Analyst",
    "time": "Now",
    "location": "Addis Ababa",
    "pertemp": "Permanent",
    "salary": "45,000",
    "description": "Data Corp is seeking a Data Analyst to analyze data and generate reports to support business decisions. The ideal candidate will have experience with data analytics tools such as SQL, Excel, and Power BI, and be able to communicate insights to stakeholders.",
    "company": "Data Corp",
    "applicationDeadline": "2024-10-31",
    "jobType": "Contract",
    "requiredDegree": "Bachelor's degree in Statistics, Mathematics, or a related field",
    "experience": "2+ years in data analysis",
    "qualification": "Proficiency in data analysis tools such as SQL, Excel, and Power BI",
    "responsibilities": "Analyze data sets, create reports, and provide insights to business teams.",
    "additional": "Experience with Python or R is a plus."
  }
]
